{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React -kehittäjä",
      "type": "Etätyö",
      "location": "Helsinki, Suomi",
      "description": "Etsimme lahjakasta Front-End-kehittäjää liittymään tiimiimme Helsingissä. Ihanteellisella hakijalla on vahvat taidot HTML-, CSS- ja JavaScript-teknologioissa sekä kokemusta nykyaikaisista JavaScript-kehyksistä, kuten React tai Angular.",
      "salary": "60 000 € - 70 000 €",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions on johtava teknologiayritys, joka keskittyy verkkokehitykseen ja digitaalisiin ratkaisuihin. Panostamme korkealaatuisten tuotteiden ja palveluiden toimittamiseen asiakkaillemme sekä luovaan ja innovatiiviseen työympäristöön.",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "2",
      "title": "Front-End-insinööri (React & Redux)",
      "type": "Kokopäivätyö",
      "location": "Espoo, Suomi",
      "description": "Liity tiimiimme Front-End-kehittäjänä Espoossa. Etsimme motivoitunutta henkilöä, joka on intohimoinen luomaan kauniita ja responsiivisia verkkosovelluksia. Kokemus käyttöliittymä-/käyttökokemussuunnittelusta ja tarkka silmä yksityiskohdille ovat erittäin toivottavia.",
      "salary": "60 000 € - 70 000 €",
      "company": {
        "name": "Veneer Solutions",
        "description": "Veneer Solutions on luova toimisto, joka erikoistuu digitaaliseen suunnitteluun ja kehitykseen. Tiimimme pyrkii ylittämään luovuuden ja innovaation rajat tarjotakseen asiakkaillemme erinomaisia tuloksia.",
        "contactEmail": "contact@loremipsum.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "3",
      "title": "React.js-kehittäjä",
      "type": "Kokopäivätyö",
      "location": "Tampere, Suomi",
      "description": "Oletko intohimoinen Front-End-kehityksestä? Liity tiimiimme Tampereella ja työskentele jännittävissä projekteissa, jotka tekevät eron. Tarjoamme kilpailukykyisen palkan ja yhteistyöhenkisen työympäristön, jossa ideoitasi arvostetaan.",
      "salary": "60 000 € - 70 000 €",
      "company": {
        "name": "Dolor Cloud",
        "description": "Dolor Cloud on johtava teknologiayritys, joka erikoistuu digitaalisiin ratkaisuihin kaiken kokoisille yrityksille. Keskitymme innovaatioihin ja asiakastyytyväisyyteen tarjotaksemme huipputeknologian tuotteita ja palveluita.",
        "contactEmail": "contact@dolorsitamet.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "4",
      "title": "React Front-End-kehittäjä",
      "type": "Osa-aikatyö",
      "location": "Oulu, Suomi",
      "description": "Liity tiimiimme osa-aikaisena Front-End-kehittäjänä Oulussa. Etsimme itseohjautuvaa henkilöä, joka on intohimoinen luomaan mukaansatempaavia käyttäjäkokemuksia. Tämä tehtävä tarjoaa joustavat työajat ja mahdollisuuden työskennellä etänä.",
      "salary": "50 000 € - 60 000 €",
      "company": {
        "name": "Alpha Elite",
        "description": "Alpha Elite on dynaaminen startup-yritys, joka erikoistuu digitaaliseen markkinointiin ja verkkokehitykseen. Olemme sitoutuneet edistämään monimuotoisuutta ja osallistavaa työpaikkaa, jossa luovuus ja innovaatiot kukoistavat.",
        "contactEmail": "contact@adipisicingelit.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "5",
      "title": "Full Stack React -kehittäjä",
      "type": "Kokopäivätyö",
      "location": "Vantaa, Suomi",
      "description": "Jännittävä mahdollisuus Full Stack -kehittäjänä Vantaalla. Etsimme lahjakasta henkilöä, joka on intohimoinen rakentamaan elegantteja ja skaalautuvia verkkosovelluksia. Liity tiimiimme ja tee vaikutus!",
      "salary": "80 000 € - 90 000 €",
      "company": {
        "name": "Browning Technologies",
        "description": "Browning Technologies on nopeasti kasvava teknologiayritys, joka erikoistuu verkkokaupparatkaisuihin. Tarjoamme dynaamisen ja yhteistyöhenkisen työympäristön, jossa työntekijöitä kannustetaan ajattelemaan luovasti ja innovoimaan.",
        "contactEmail": "contact@consecteturadipisicing.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "6",
      "title": "React Native -kehittäjä",
      "type": "Kokopäivätyö",
      "location": "Jyväskylä, Suomi",
      "description": "Liity tiimiimme Front-End-kehittäjänä Jyväskylässä. Etsimme taitavaa ja innostunutta henkilöä auttamaan meitä luomaan innovatiivisia verkkoratkaisuja. Tarjoamme kilpailukykyisen palkan ja erinomaisen etupaketin.",
      "salary": "90 000 € - 100 000 €",
      "company": {
        "name": "Port Solutions INC",
        "description": "Port Solutions on johtava teknologiayritys, joka erikoistuu ohjelmistokehitykseen ja digitaaliseen markkinointiin. Olemme sitoutuneet tarjoamaan asiakkaillemme huipputason ratkaisuja ja työntekijöillemme tukevan ja palkitsevan työympäristön.",
        "contactEmail": "contact@ipsumlorem.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "7",
      "title": "Harjoittelia Front-End-kehittäjä",
      "type": "Työharjoittelu",
      "location": "Turku, Suomi",
      "description": "Etsimme innokasta Harjoitteliaa liittymään tiimiimme Turussa. Tämä on loistava tilaisuus aloittaa ura kehittyvässä teknologiayrityksessä, joka tarjoaa koulutusta ja mentorointia. Tarvitsee osata React ulkoa kokonaan.",
      "salary": "Työharjoittelu",
      "company": {
        "name": "Aurora Tech",
        "description": "Aurora Tech on kasvava ohjelmistoyritys, joka keskittyy verkkosovellusten kehittämiseen. Tiimimme koostuu kokeneista kehittäjistä ja uusista kyvyistä, jotka yhdessä luovat innovatiivisia ratkaisuja.",
        "contactEmail": "contact@auroratech.fi",
        "contactPhone": "555-555-5556"
      }
    },
    {
      "id": "8",
      "title": "React Native -kehittäjä",
      "type": "Etätyö",
      "location": "Tampere, Suomi",
      "description": "Etsimme React Native -kehittäjää luomaan mobiilisovelluksia asiakasprojekteihimme. Työ on täysin etätyöpohjaista, mutta tarjoaa mahdollisuuden satunnaisiin tapaamisiin Tampereella.",
      "salary": "65 000 € - 75 000 €",
      "company": {
        "name": "AppSolvers Oy",
        "description": "AppSolvers Oy on erikoistunut mobiilisovellusten kehittämiseen. Olemme ylpeitä käyttäjäystävällisistä ja korkealaatuisista sovelluksista, joita toimitamme asiakkaillemme.",
        "contactEmail": "jobs@appsolvers.fi",
        "contactPhone": "555-555-5557"
      }
    },
    {
      "id": "9",
      "title": "Full Stack -kehittäjä",
      "type": "Kokopäivätyö",
      "location": "Lahti, Suomi",
      "description": "Haemme Full Stack -kehittäjää monipuolisiin ohjelmistokehitystehtäviin. Tehtävässä käytetään moderneja teknologioita, kuten React ja Node.js.",
      "salary": "70 000 € - 85 000 €",
      "company": {
        "name": "TechForge",
        "description": "TechForge on Lahdessa toimiva teknologiayritys, joka keskittyy liiketoimintaratkaisuihin ja räätälöityjen ohjelmistojen kehittämiseen.",
        "contactEmail": "careers@techforge.fi",
        "contactPhone": "555-555-5558"
      }
    },
    {
      "id": "10",
      "title": "UI/UX-suunnittelija",
      "type": "Osa-aikatyö",
      "location": "Kuopio, Suomi",
      "description": "Etsimme osa-aikaista UI/UX-suunnittelijaa tukemaan tiimiämme käyttäjäystävällisten ja kauniiden käyttöliittymien suunnittelussa.",
      "salary": "45 000 € - 55 000 €",
      "company": {
        "name": "DesignPro",
        "description": "DesignPro on Kuopiossa toimiva suunnittelutoimisto, joka keskittyy käyttöliittymäsuunnitteluun ja käyttäjäkokemukseen.",
        "contactEmail": "hello@designpro.fi",
        "contactPhone": "555-555-5559"
      }
    },
    {
      "id": "11",
      "title": "Junior React-kehittäjä",
      "type": "Kokopäivätyö",
      "location": "Vaasa, Suomi",
      "description": "Tarjoamme mahdollisuuden päästä mukaan mielenkiintoisiin projekteihin osana tiimiämme Vaasassa. Erinomainen tilaisuus oppia ja kehittyä urallasi.",
      "salary": "40 000 € - 50 000 €",
      "company": {
        "name": "Northern Lights Software",
        "description": "Northern Lights Software on Vaasan johtava ohjelmistoyritys, joka palvelee niin kotimaisia kuin kansainvälisiä asiakkaita.",
        "contactEmail": "careers@northernlights.fi",
        "contactPhone": "555-555-5560"
      }
    },
    {
      "id": "12",
      "title": "React-kehittäjä (pilvipalvelut)",
      "type": "Kokopäivätyö",
      "location": "Jyväskylä, Suomi",
      "description": "Etsimme React-kehittäjää, jolla on kokemusta pilvipalveluista ja skaalautuvista verkkosovelluksista. Työ on Jyväskylä-pohjainen, mutta joustavat työajat ovat mahdollisia.",
      "salary": "75 000 € - 85 000 €",
      "company": {
        "name": "CloudWorks Oy",
        "description": "CloudWorks Oy on moderni teknologiayritys, joka tarjoaa asiakkailleen huipputason pilviratkaisuja.",
        "contactEmail": "jobs@cloudworks.fi",
        "contactPhone": "555-555-5561"
      }
    },
    {
      "id": "13",
      "title": "Senior Full Stack -kehittäjä",
      "type": "Kokopäivätyö",
      "location": "Rovaniemi, Suomi",
      "description": "Haemme kokenutta Full Stack -kehittäjää, joka osaa yhdistää asiakasrajapinnat ja back-end-ratkaisut saumattomasti.",
      "salary": "85 000 € - 100 000 €",
      "company": {
        "name": "Arctic Code Oy",
        "description": "Arctic Code Oy on Rovaniemellä sijaitseva ohjelmistoyritys, joka tarjoaa asiakkailleen kattavia ohjelmistokehityspalveluita.",
        "contactEmail": "contact@arcticcode.fi",
        "contactPhone": "555-555-5562"
      }
    },
    {
      "id": "14",
      "title": "React Front-End-kehittäjä",
      "type": "Osa-aikatyö",
      "location": "Joensuu, Suomi",
      "description": "Etsimme osa-aikaista React-kehittäjää osaksi tiimiämme. Tehtävät sisältävät verkkosovellusten kehitystä ja käyttökokemuksen optimointia.",
      "salary": "50 000 € - 60 000 €",
      "company": {
        "name": "Eastern Web Solutions",
        "description": "Eastern Web Solutions on Joensuussa toimiva verkkokehitykseen erikoistunut yritys.",
        "contactEmail": "jobs@easternweb.fi",
        "contactPhone": "555-555-5563"
      }
    },
    {
      "id": "15",
      "title": "React Front-End-kehittäjä (Junior)",
      "type": "Etätyö",
      "location": "Hämeenlinna, Suomi",
      "description": "Liity mukaan etätyötiimiimme kehittämään uusia verkkosovelluksia. Tämä tehtävä sopii erityisesti uraansa aloitteleville kehittäjille.",
      "salary": "40 000 € - 50 000 €",
      "company": {
        "name": "HämeSoft Oy",
        "description": "HämeSoft Oy kehittää innovatiivisia verkkosovelluksia paikallisille ja kansainvälisille markkinoille.",
        "contactEmail": "info@hamesoft.fi",
        "contactPhone": "555-555-5564"
      }
    },
    {
      "id": "6251",
      "title": "asd",
      "type": "Full-Time",
      "location": "Oulu, Suomi",
      "description": "asd",
      "salary": "€125K - 150K",
      "company": {
        "name": "Palodex group",
        "description": "asd",
        "contactEmail": "Palodex@group.fi",
        "contactPhone": "050 112 233 4"
      }
    },
    {
      "id": "d695",
      "title": "asd",
      "type": "Full-Time",
      "location": "Oulu, Suomi",
      "description": "asd",
      "salary": "Alle €50K",
      "company": {
        "name": "Palodex group",
        "description": "asdw",
        "contactEmail": "Palodex@group.fi",
        "contactPhone": "050 112 233 4"
      }
    }
  ]
}